<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.3" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>GLPI Agent GPO configuration</displayName>
  <description>GLPI Agent GPO configuration</description>
  <resources>
    <stringTable>
      <string id="GLPI_ROOT">GLPI Agent</string>
      <string id="GLPI_CONFIGURE32on64">Configure the 32-bit agent on 64 bit computers</string>
      <string id="GLPI_CONFIGURE">Configure the agent</string>
      <string id="GLPI_CONFIGURE_EXPLAIN">Specify the paramaters for GLPI Agent.</string>
    </stringTable>
    <presentationTable>
      <presentation id="GLPI_CONFIGURE">
        <textBox refId="GLPI_Server">
          <label>Server</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_Proxy">
          <label>Proxy server</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_User">
          <label>Proxy User</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_Password">
          <label>Proxy Password</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_Tag">
          <label>Tag</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_ca-cert-dir">
          <label>CA-cert-dir</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_ca-cert-file">
          <label>CA-cert-file</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_ssl-fingerprint">
          <label>ssl-fingerprint</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_httpd-ip">
          <label>httpd-ip</label>
          <defaultValue>0.0.0.0</defaultValue>
        </textBox>
        <textBox refId="GLPI_httpd-port">
          <label>httpd-port</label>
          <defaultValue>62354</defaultValue>
        </textBox>
        <textBox refId="GLPI_httpd-trust">
          <label>httpd-trust</label>
          <defaultValue>127.0.0.1/32</defaultValue>
        </textBox>
        <textBox refId="GLPI_no-category">
          <label>no-category</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_no-task">
          <label>no-task</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_tasks">
          <label>tasks</label>
          <defaultValue></defaultValue>
        </textBox>
        <textBox refId="GLPI_delaytime">
          <label>Delaytime</label>
          <defaultValue>3600</defaultValue>
        </textBox>
        <textBox refId="GLPI_timeout">
          <label>Timeout</label>
          <defaultValue>180</defaultValue>
        </textBox>
        <textBox refId="GLPI_backend-collect-timeout">
          <label>backend-collect-timeout</label>
          <defaultValue>180</defaultValue>
        </textBox>
        <comboBox refId="GLPI_debug" noSort="true">
          <label>Debug level</label>
          <default>0</default>
          <suggestion>1</suggestion>
          <suggestion>2</suggestion>
        </comboBox>
        <checkBox refId="GLPI_no-ssl-check" defaultChecked="false" >no-ssl-check</checkBox>
        <checkBox refId="GLPI_no-p2p" defaultChecked="false" >no-p2p</checkBox>
        <checkBox refId="GLPI_scan-homedirs" defaultChecked="false">scan-homedirs</checkBox>
        <checkBox refId="GLPI_scan-profiles" defaultChecked="false">scan-profiles</checkBox>
        <checkBox refId="GLPI_no-httpd">no-httpd</checkBox>
        <textBox refId="GLPI_full-inventory-postpone">
          <label>full-inventory-postpone</label>
          <defaultValue>14</defaultValue>
        </textBox>
        <checkBox refId="GLPI_json">json</checkBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
