<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.3" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="GLPI-Agent" namespace="GLPI-Agent" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.3" />
  <categories>
    <category name="GLPI_ROOT" displayName="$(string.GLPI_ROOT)">
      <parentCategory ref="windows:System" />
    </category>
  </categories>
  <policies>
    <policy name="GLPI_CONFIGURE" class="Machine" displayName="$(string.GLPI_CONFIGURE)" explainText="$(string.GLPI_CONFIGURE_EXPLAIN)" presentation="$(presentation.GLPI_CONFIGURE)" key="SOFTWARE\GLPI-Agent">
      <parentCategory ref="GLPI_ROOT" />
      <supportedOn ref="windows:SUPPORTED_WindowsXP" />
      <elements>
        <text id="GLPI_Server" key="SOFTWARE\GLPI-Agent" valueName="server" required="true" />
        <text id="GLPI_Proxy" key="SOFTWARE\GLPI-Agent" valueName="proxy" />
        <text id="GLPI_User" key="SOFTWARE\GLPI-Agent" valueName="user" />
        <text id="GLPI_Password" key="SOFTWARE\GLPI-Agent" valueName="password" />
        <text id="GLPI_Tag" key="SOFTWARE\GLPI-Agent" valueName="tag" />
        <text id="GLPI_ca-cert-dir" key="SOFTWARE\GLPI-Agent" valueName="ca-cert-dir" />
        <text id="GLPI_ca-cert-file" key="SOFTWARE\GLPI-Agent" valueName="ca-cert-file" />
        <text id="GLPI_ssl-fingerprint" key="SOFTWARE\GLPI-Agent" valueName="ssl-fingerprint" />
        <text id="GLPI_httpd-ip" key="SOFTWARE\GLPI-Agent" valueName="httpd-ip" />
        <text id="GLPI_httpd-port" key="SOFTWARE\GLPI-Agent" valueName="httpd-port" required="true" />
        <text id="GLPI_httpd-trust" key="SOFTWARE\GLPI-Agent" valueName="httpd-trust" required="true" />
        <text id="GLPI_no-category" key="SOFTWARE\GLPI-Agent" valueName="no-category" />
        <text id="GLPI_no-task" key="SOFTWARE\GLPI-Agent" valueName="no-task" />
        <text id="GLPI_tasks" key="SOFTWARE\GLPI-Agent" valueName="tasks" />
        <text id="GLPI_delaytime" key="SOFTWARE\GLPI-Agent" valueName="delaytime" required="true" />
        <text id="GLPI_timeout" key="SOFTWARE\GLPI-Agent" valueName="timeout" required="true" />
        <text id="GLPI_backend-collect-timeout" key="SOFTWARE\GLPI-Agent" valueName="backend-collect-timeout" required="true" />
        <text id="GLPI_debug" key="SOFTWARE\GLPI-Agent" valueName="debug" required="true" />
        <boolean id="GLPI_no-ssl-check" key="SOFTWARE\GLPI-Agent" valueName="no-ssl-check">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_no-p2p" key="SOFTWARE\GLPI-Agent" valueName="no-p2p">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_scan-homedirs" key="SOFTWARE\GLPI-Agent" valueName="scan-homedirs">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_scan-profiles" key="SOFTWARE\GLPI-Agent" valueName="scan-profiles">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_no-httpd" key="SOFTWARE\GLPI-Agent" valueName="no-httpd">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <text id="GLPI_full-inventory-postpone" key="SOFTWARE\GLPI-Agent" valueName="full-inventory-postpone" required="true" />
        <boolean id="GLPI_json" key="SOFTWARE\GLPI-Agent" valueName="json">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="GLPI_CONFIGURE32on64" class="Machine" displayName="$(string.GLPI_CONFIGURE32on64)" explainText="$(string.GLPI_CONFIGURE_EXPLAIN)" presentation="$(presentation.GLPI_CONFIGURE)" key="SOFTWARE\Wow6432Node\GLPI-Agent">
      <parentCategory ref="GLPI_ROOT" />
      <supportedOn ref="windows:SUPPORTED_WindowsXP" />
      <elements>
        <text id="GLPI_Server" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="server" required="true" />
        <text id="GLPI_Proxy" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="proxy" />
        <text id="GLPI_User" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="user" />
        <text id="GLPI_Password" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="password" />
        <text id="GLPI_Tag" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="tag" />
        <text id="GLPI_ca-cert-dir" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="ca-cert-dir" />
        <text id="GLPI_ca-cert-file" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="ca-cert-file" />
        <text id="GLPI_ssl-fingerprint" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="ssl-fingerprint" />
        <text id="GLPI_httpd-ip" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="httpd-ip" defaultValue="0.0.0.0" />
        <text id="GLPI_httpd-port" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="httpd-port" required="true" />
        <text id="GLPI_httpd-trust" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="httpd-trust" required="true" />
        <text id="GLPI_no-category" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="no-category" />
        <text id="GLPI_no-task" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="no-task" />
        <text id="GLPI_tasks" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="tasks" />
        <text id="GLPI_delaytime" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="delaytime" required="true" />
        <text id="GLPI_timeout" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="timeout" required="true" />
        <text id="GLPI_backend-collect-timeout" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="backend-collect-timeout" required="true" />
        <text id="GLPI_debug" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="debug" required="true" />
        <boolean id="GLPI_no-ssl-check" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="no-ssl-check">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="GLPI_no-p2p" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="no-p2p">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_scan-homedirs" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="scan-homedirs">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_scan-profiles" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="scan-profiles">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <boolean id="GLPI_no-httpd" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="no-httpd">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
        <text id="GLPI_full-inventory-postpone" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="full-inventory-postpone" required="true" />
        <boolean id="GLPI_json" key="SOFTWARE\Wow6432Node\GLPI-Agent" valueName="json">
          <trueValue>
            <string>1</string>
          </trueValue>
          <falseValue>
            <string>0</string>
          </falseValue>
        </boolean>
      </elements>
    </policy>
  </policies>
</policyDefinitions>
